21mw12/CW32_Voltammeter/电压电流表资料/3 基础实验例程/实验五_ADC采样显示/Driver/cw32f003_rcc.h
/**
 * @file cw32f003_rcc.h
 * @author your name (you@domain.com)
 * @brief 
 * @version 0.1
 * @date 2021-05-13
 * 
 * @copyright Copyright (c) 2021
 * 
 */
/*******************************************************************************
*
* 代码许可和免责信息
* 武汉芯源半导体有限公司授予您使用所有编程代码示例的非专属的版权许可，您可以由此
* 生成根据您的特定需要而定制的相似功能。根据不能被排除的任何法定保证，武汉芯源半
* 导体有限公司及其程序开发商和供应商对程序或技术支持（如果有）不提供任何明示或暗
* 含的保证或条件，包括但不限于暗含的有关适销性、适用于某种特定用途和非侵权的保证
* 或条件。
* 无论何种情形，武汉芯源半导体有限公司及其程序开发商或供应商均不对下列各项负责，
* 即使被告知其发生的可能性时，也是如此：数据的丢失或损坏；直接的、特别的、附带的
* 或间接的损害，或任何后果性经济损害；或利润、业务、收入、商誉或预期可节省金额的
* 损失。
* 某些司法辖区不允许对直接的、附带的或后果性的损害有任何的排除或限制，因此某些或
* 全部上述排除或限制可能并不适用于您。
*
*******************************************************************************/

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __CW32F003_RCC_H
#define __CW32F003_RCC_H
                        
#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "cw32f003.h"


//==================================================================================

#define HSIOSC_VALUE                             ((uint32_t)48000000)/*!<ValueoftheInternaloscillatorinHz*/
#define HEX_VALUE                                ((uint32_t)16000000)/*!<ValueoftheExternaloscillatorinHz*/
#define LSI_VALUE                                ((uint32_t)32800)/*!<ValueoftheExternaloscillatorinHz*/

/* SYSCTRL CR0 --------------------------------------------------------*/
#define SYSCTRL_BYPASS                           (0x5A5A0000U)
#define SYSCTRL_BYPASS_MASK                      (0xFFFF0000U)

#define RCC_HCLK_DIV1                            (0x0UL<<SYSCTRL_CR0_HCLKPRS_Pos)/*!<SYSCLKnotdivided*/
#define RCC_HCLK_DIV2                            (0x1UL<<SYSCTRL_CR0_HCLKPRS_Pos)/*!<SYSCLKdividedby2*/
#define RCC_HCLK_DIV4                            (0x2UL<<SYSCTRL_CR0_HCLKPRS_Pos)/*!<SYSCLKdividedby4*/
#define RCC_HCLK_DIV8                            (0x3UL<<SYSCTRL_CR0_HCLKPRS_Pos)/*!<SYSCLKdividedby8*/
#define RCC_HCLK_DIV16                           (0x4UL<<SYSCTRL_CR0_HCLKPRS_Pos)/*!<SYSCLKdividedby16*/
#define RCC_HCLK_DIV32                           (0x5UL<<SYSCTRL_CR0_HCLKPRS_Pos)/*!<SYSCLKdividedby32*/
#define RCC_HCLK_DIV64                           (0x6UL<<SYSCTRL_CR0_HCLKPRS_Pos)/*!<SYSCLKdividedby64*/
#define RCC_HCLK_DIV128                          (0x7ul<<SYSCTRL_CR0_HCLKPRS_Pos)/*!<SYSCLKdividedby128*/
#define IS_RCC_HCLKPRS(INSTANCE)                 (((INSTANCE)==RCC_HCLK_DIV1)||\
                                                 ((INSTANCE) == RCC_HCLK_DIV2)       ||\
                                                 ((INSTANCE) == RCC_HCLK_DIV4)       ||\
                                                 ((INSTANCE) == RCC_HCLK_DIV8)       ||\
                                                 ((INSTANCE) == RCC_HCLK_DIV16)      ||\
                                                 ((INSTANCE) == RCC_HCLK_DIV32)      ||\
                                                 ((INSTANCE) == RCC_HCLK_DIV64)      ||\
                                                 ((INSTANCE) == RCC_HCLK_DIV128))

#define RCC_PCLK_DIV1                            (0x0UL<<SYSCTRL_CR0_PCLKPRS_Pos)/*!<HCLKnotdivided*/
#define RCC_PCLK_DIV2                            (0x1UL<<SYSCTRL_CR0_PCLKPRS_Pos)/*!<HCLKdividedby2*/
#define RCC_PCLK_DIV4                            (0x2UL<<SYSCTRL_CR0_PCLKPRS_Pos)/*!<HCLKdividedby4*/
#define RCC_PCLK_DIV8                            (0x3UL<<SYSCTRL_CR0_PCLKPRS_Pos)/*!<HCLKdividedby8*/
#define IS_RCC_PCLKPRS(INSTANCE)                 (((INSTANCE)==RCC_PCLK_DIV1)||\
                                                 ((INSTANCE) == RCC_PCLK_DIV2)       ||\
                                                 ((INSTANCE) == RCC_PCLK_DIV4)       ||\
                                                 ((INSTANCE) == RCC_PCLK_DIV8)   

#define RCC_SYSCLKSRC_HSI                        (0x00000000U)/*!<HSIselectedassystemclock*/
#define RCC_SYSCLKSRC_HEX                        (0x00000001U)/*!<HEXselectedassystemclock*/
#define RCC_SYSCLKSRC_LSI                        (0x00000003U)/*!<LSIselectedassystemclock*/
#define IS_RCC_SYSCLKSRC(INSTANCE)               (((INSTANCE)==RCC_SYSCLKSRC_HSI)||\
                                                 ((INSTANCE) == RCC_SYSCLKSRC_HEX)   ||\
                                                 ((INSTANCE) == RCC_SYSCLKSRC_LSE))

/* SYSCTRL CR1 --------------------------------------------------------*/
#define RCC_SYSCTRL_HSIEN                        bv0
#define RCC_SYSCTRL_HEXEN                        bv1
#define RCC_SYSCTRL_LSIEN                        bv3

/* SYSCTRL CR2 --------------------------------------------------------*/
#define RCC_SYSCTRL_RSTIOEN                      0x00UL
#define RCC_SYSCTRL_RSTIODIS                     bv0
#define IS_RCC_RSTIO_STATUS(INSTANCE)            (((INSTANCE)==RCC_SYSCTRL_RSTIOEN)||\
                                                 ((INSTANCE) == RCC_SYSCTRL_RSTIODIS))
   
#define RCC_SYSCTRL_SWDIOEN                      0x00UL
#define RCC_SYSCTRL_SWDIODIS                     bv1
#define IS_RCC_SWDIO_STATUS(INSTANCE)            (((INSTANCE)==RCC_SYSCTRL_SWDIOEN)||\
                                                 ((INSTANCE) == RCC_SYSCTRL_SWDIODIS))
   
#define RCC_SYSCTRL_LOCKUPEN                     bv2
#define RCC_SYSCTRL_LOCKUPDIS                    0x00UL
#define IS_RCC_LOCKUP_STATUS(INSTANCE)           (((INSTANCE)==RCC_SYSCTRL_LOCKUPEN)||\
                                                 ((INSTANCE) == RCC_SYSCTRL_LOCKUPDIS))

#define RCC_SYSCTRL_WAKEUPCLKEN                  bv3
#define RCC_SYSCTRL_WAKEUPCLKDIS                 0x00UL
#define IS_RCC_WAKEUPCLK_STATUS(INSTANCE)        (((INSTANCE)==RCC_SYSCTRL_WAKEUPCLKEN)||\
                                                 ((INSTANCE) == RCC_SYSCTRL_WAKEUPCLKDIS))               

