21mw12/CW32_Voltammeter/电压电流表资料/3 基础实验例程/实验五_ADC采样显示/Driver/cw32f003_rcc.h
/* SYSCTRL HSI --------------------------------------------------------*/
#define RCC_HSI_TRIMCODEADDR                     (0x001007B8U)//

#define RCC_HSIOSC_DIV6                          (0x5U)
#define RCC_HSIOSC_DIV1                          (0x6U)
#define RCC_HSIOSC_DIV2                          (0x8U)
#define RCC_HSIOSC_DIV4                          (0x9U)
#define RCC_HSIOSC_DIV8                          (0xBU)
#define RCC_HSIOSC_DIV10                         (0xCU)
#define RCC_HSIOSC_DIV12                         (0xDU)
#define RCC_HSIOSC_DIV14                         (0xEU)
#define RCC_HSIOSC_DIV16                         (0xFU)

#define IS_RCC_HSIOSC_DIV(INSTANCE)              (((INSTANCE)==RCC_HSIOSC_DIV1)||\
                                                 ((INSTANCE) == RCC_HSIOSC_DIV2)          ||\
                                                 ((INSTANCE) == RCC_HSIOSC_DIV4)          ||\
                                                 ((INSTANCE) == RCC_HSIOSC_DIV6)          ||\
                                                 ((INSTANCE) == RCC_HSIOSC_DIV8)          ||\
                                                 ((INSTANCE) == RCC_HSIOSC_DIV10)         ||\
                                                 ((INSTANCE) == RCC_HSIOSC_DIV12)         ||\
                                                 ((INSTANCE) == RCC_HSIOSC_DIV14)         ||\
                                                 ((INSTANCE) == RCC_HSIOSC_DIV16))

/* SYSCTRL LSI --------------------------------------------------------*/
#define RCC_LSI_TRIMCODEADDR                     (0x001007BAU)
   
#define RCC_LSI_WAITCYCLE_6                      ((uint32_t)(0x0UL<<SYSCTRL_LSI_WAITCYCLE_Pos))
#define RCC_LSI_WAITCYCLE_18                     ((uint32_t)(0x1UL<<SYSCTRL_LSI_WAITCYCLE_Pos))
#define RCC_LSI_WAITCYCLE_66                     ((uint32_t)(0x2UL<<SYSCTRL_LSI_WAITCYCLE_Pos))
#define RCC_LSI_WAITCYCLE_258                    ((uint32_t)(0x3UL<<SYSCTRL_LSI_WAITCYCLE_Pos))


/* SYSCTRL HEX --------------------------------------------------------*/
#define RCC_HEX_PINEN                            bv6
#define RCC_HEX_PINDIS                           0x0U
#define IS_RCC_HEX_PIN_MODE(INSTANCE)            (((INSTANCE)==RCC_HEX_PINEN)||\
                                                 ((INSTANCE) == RCC_HEX_PINDIS))

#define RCC_HEX_PINMUX_PB00                      0x0U
#define RCC_HEX_PINMUX_PB01                      bv7
#define IS_RCC_HEX_PINMUX_MODE(INSTANCE)         (((INSTANCE)==RCC_HEX_PINMUX_PB00)||\
                                                 ((INSTANCE) == RCC_HEX_PINMUX_PB01))
    
/* SYSCTRL IER --------------------------------------------------------*/
#define RCC_IT_LSIRDY                            (bv3)
#define RCC_IT_HEXRDY                            (bv1)
#define RCC_IT_HSIRDY                            (bv0)
#define IS_RCC_IT(IT)                            (((IT)&0xFFFFFFE0==0x0UL)&&((IT)!=0x0UL))
#define IS_RCC_GET_IT(IT)                        (((IT)==RCC_IT_LSIRDY)||\
                                                 ((IT) == RCC_IT_HEXRDY) ||\
                                                 ((IT) == RCC_IT_HSIRDY))

/* SYSCTRL ISR --------------------------------------------------------*/
#define RCC_FLAG_HSISTABLE                       bv11
#define RCC_FLAG_HEXSTABLE                       bv12
#define RCC_FLAG_LSISTABLE                       bv14
#define IS_RCC_STABLEFLAG(FLAG)                  (((FLAG)==RCC_FLAG_HSISTABLE)||((FLAG)==RCC_FLAG_HEXSTABLE)||\
                                                 ((FLAG) == RCC_FLAG_LSISTABLE))

/* SYSCTRL AHBEN --------------------------------------------------------*/
#define RCC_AHB_PERIPH_GPIOC                     bv6
#define RCC_AHB_PERIPH_GPIOB                     bv5
#define RCC_AHB_PERIPH_GPIOA                     bv4
#define RCC_AHB_PERIPH_CRC                       bv2
#define RCC_AHB_PERIPH_FLASH                     bv1
#define IS_RCC_AHB_PERIPH(PERIPH)                ((((PERIPH)&0xFFFFFFF8)==0x00)&&((PERIPH)!=0x00))


#define __RCC_GPIOC_CLK_ENABLE()                 REGBITS_SET(CW_SYSCTRL->AHBEN,RCC_AHB_PERIPH_GPIOC)
#define __RCC_GPIOB_CLK_ENABLE()                 REGBITS_SET(CW_SYSCTRL->AHBEN,RCC_AHB_PERIPH_GPIOB)
#define __RCC_GPIOA_CLK_ENABLE()                 REGBITS_SET(CW_SYSCTRL->AHBEN,RCC_AHB_PERIPH_GPIOA)
#define __RCC_CRC_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->AHBEN,RCC_AHB_PERIPH_CRC)
#define __RCC_FLASH_CLK_ENABLE()                 REGBITS_SET(CW_SYSCTRL->AHBEN,RCC_AHB_PERIPH_FLASH)

#define __RCC_GPIOC_CLK_DISABLE()                (CW_SYSCTRL->AHBEN&=~(RCC_AHB_PERIPH_GPIOC))
#define __RCC_GPIOB_CLK_DISABLE()                (CW_SYSCTRL->AHBEN&=~(RCC_AHB_PERIPH_GPIOB))
#define __RCC_GPIOA_CLK_DISABLE()                (CW_SYSCTRL->AHBEN&=~(RCC_AHB_PERIPH_GPIOA))
#define __RCC_CRC_CLK_DISABLE()                  (CW_SYSCTRL->AHBEN&=~(RCC_AHB_PERIPH_CRC))
#define __RCC_FLASH_CLK_DISABLE()                (CW_SYSCTRL->AHBEN&=~(RCC_AHB_PERIPH_FLASH))

/* SYSCTRL AHPEN1 --------------------------------------------------------*/
#define RCC_APB1_PERIPH_I2C                      bv11
#define RCC_APB1_PERIPH_UART2                    bv7
#define RCC_APB1_PERIPH_IWDT                     bv5
#define RCC_APB1_PERIPH_WWDT                     bv4
#define RCC_APB1_PERIPH_GTIM                     bv1
#define IS_RCC_APB1_PERIPH(PERIPH)               ((((PERIPH)&0xFFFFF74D)==0x00)&&((PERIPH)!=0x00))

#define __RCC_I2C_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->APBEN1,RCC_APB1_PERIPH_I2C)
#define __RCC_UART2_CLK_ENABLE()                 REGBITS_SET(CW_SYSCTRL->APBEN1,RCC_APB1_PERIPH_UART2)
#define __RCC_IWDT_CLK_ENABLE()                  REGBITS_SET(CW_SYSCTRL->APBEN1,RCC_APB1_PERIPH_IWDT)
#define __RCC_WWDT_CLK_ENABLE()                  REGBITS_SET(CW_SYSCTRL->APBEN1,RCC_APB1_PERIPH_WWDT)
#define __RCC_GTIM_CLK_ENABLE()                  REGBITS_SET(CW_SYSCTRL->APBEN1,RCC_APB1_PERIPH_GTIM)

#define __RCC_I2C_CLK_DISABLE()                  (CW_SYSCTRL->APBEN1&=~(RCC_APB1_PERIPH_I2C))
#define __RCC_UART2_CLK_DISABLE()                (CW_SYSCTRL->APBEN1&=~(RCC_APB1_PERIPH_UART2))
#define __RCC_IWDT_CLK_DISABLE()                 (CW_SYSCTRL->APBEN1&=~(RCC_APB1_PERIPH_IWDT))
#define __RCC_WWDT_CLK_DISABLE()                 (CW_SYSCTRL->APBEN1&=~(RCC_APB1_PERIPH_WWDT))
#define __RCC_GTIM_CLK_DISABLE()                 (CW_SYSCTRL->APBEN1&=~(RCC_APB1_PERIPH_GTIM))

/* SYSCTRL AHPEN1 --------------------------------------------------------*/
#define RCC_APB2_PERIPH_AWT                      bv13
#define RCC_APB2_PERIPH_BTIM                     bv12
#define RCC_APB2_PERIPH_UART1                    bv9
#define RCC_APB2_PERIPH_SPI                      bv8
#define RCC_APB2_PERIPH_ATIM                     bv7
#define RCC_APB2_PERIPH_VC                       bv4
#define RCC_APB2_PERIPH_ADC                      bv2
#define IS_RCC_APB2_PERIPH(PERIPH)               ((((PERIPH)&0xFFFFCC63)==0x00)&&((PERIPH)!=0x00))

#define __RCC_AWT_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->APBEN2,RCC_APB2_PERIPH_AWT)
#define __RCC_BTIM_CLK_ENABLE()                  REGBITS_SET(CW_SYSCTRL->APBEN2,RCC_APB2_PERIPH_BTIM)
#define __RCC_UART1_CLK_ENABLE()                 REGBITS_SET(CW_SYSCTRL->APBEN2,RCC_APB2_PERIPH_UART1)
#define __RCC_SPI_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->APBEN2,RCC_APB2_PERIPH_SPI)
#define __RCC_ATIM_CLK_ENABLE()                  REGBITS_SET(CW_SYSCTRL->APBEN2,RCC_APB2_PERIPH_ATIM)
#define __RCC_VC_CLK_ENABLE()                    REGBITS_SET(CW_SYSCTRL->APBEN2,RCC_APB2_PERIPH_VC)
#define __RCC_ADC_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->APBEN2,RCC_APB2_PERIPH_ADC)

#define __RCC_AWT_CLK_DISABLE()                  (CW_SYSCTRL->APBEN2&=~(RCC_APB2_PERIPH_AWT))
#define __RCC_BTIM_CLK_DISABLE()                 (CW_SYSCTRL->APBEN2&=~(RCC_APB2_PERIPH_BTIM))
#define __RCC_UART1_CLK_DISABLE()                (CW_SYSCTRL->APBEN2&=~(RCC_APB2_PERIPH_UART1))
#define __RCC_SPI_CLK_DISABLE()                  (CW_SYSCTRL->APBEN2&=~(RCC_APB2_PERIPH_SPI))
#define __RCC_ATIM_CLK_DISABLE()                 (CW_SYSCTRL->APBEN2&=~(RCC_APB2_PERIPH_ATIM))
#define __RCC_VC_CLK_DISABLE()                   (CW_SYSCTRL->APBEN2&=~(RCC_APB2_PERIPH_VC))
#define __RCC_ADC_CLK_DISABLE()                  (CW_SYSCTRL->APBEN2&=~(RCC_APB2_PERIPH_ADC))

/* SYSCTRL AHBRST --------------------------------------------------------*/
#define RCC_AHBRST_GPIOC                         bv6
#define RCC_AHBRST_GPIOB                         bv5
#define RCC_AHBRST_GPIOA                         bv4
#define RCC_AHBRST_CRC                           bv2
#define RCC_AHBRST_FLASH                         bv1
#define RCC_AHBRST_ALL                           ((uint32_t)0x00000076)
#define IS_RCC_AHBRST(PERIPH)                    ((((PERIPH)&0xFFFFFF89)==0x00)&&((PERIPH)!=0x00))

/* SYSCTRL APBRST1 --------------------------------------------------------*/
#define RCC_APBRST1_I2C                          bv11
#define RCC_APBRST1_UART2                        bv7
#define RCC_APBRST1_IWDT                         bv5
#define RCC_APBRST1_WWDT                         bv4
#define RCC_APBRST1_GTIM                         bv1
#define RCC_APBRST1_ALL                          ((uint32_t)0x000008B2)
#define IS_RCC_APBRST1(PERIPH)                   ((((PERIPH)&0xFFFFF74D)==0x00)&&((PERIPH)!=0x00))

/* SYSCTRL APBRST2 --------------------------------------------------------*/
#define RCC_APBRST2_AWT                          bv13
#define RCC_APBRST2_BTIM                         bv12
#define RCC_APBRST2_UART1                        bv9
#define RCC_APBRST2_SPI                          bv8
#define RCC_APBRST2_ATIM                         bv7
#define RCC_APBRST2_VC                           bv4
#define RCC_APBRST2_ADC                          bv2
#define RCC_APBRST2_ALL                          ((uint32_t)0x00003394)
#define IS_RCC_APBRST2(PERIPH)                   ((((PERIPH)&0xFFFFCC6B)==0x00)&&((PERIPH)!=0x00))

/* SYSCTRL RESTFLAG --------------------------------------------------------*/
#define RCC_RESTFLAG_SYSRESETREQ                 bv9
#define RCC_RESTFLAG_LOCKUP                      bv8
#define RCC_RESTFLAG_RSTB                        bv6
#define RCC_RESTFLAG_WWDT                        bv5
#define RCC_RESTFLAG_IWDT                        bv4
#define RCC_RESTFLAG_LVD                         bv3
#define RCC_RESTFLAG_POR                         bv0
#define RCC_RESTFLAG_ALL                         ((uint32_t)0xFFFFFFFF)
#define IS_RCC_RESTFLAG(FLAG)                    (((FLAG)==RCC_RESTFLAG_SYSRESETREQ)||\
                                                 ((FLAG) == RCC_RESTFLAG_LOCKUP) ||      \
                                                 ((FLAG) == RCC_RESTFLAG_RSTB) ||        \
                                                 ((FLAG) == RCC_RESTFLAG_WWDT) ||        \
                                                 ((FLAG) == RCC_RESTFLAG_IWDT) ||        \
                                                 ((FLAG) == RCC_RESTFLAG_LVD) ||         \
                                                 ((FLAG) == RCC_RESTFLAG_POR) ||         \
                                                 ((FLAG) == RCC_RESTFLAG_ALL))

/* SYSCTRL DEBUG --------------------------------------------------------*/
#define RCC_DEBUG_WWDT                           bv10
#define RCC_DEBUG_IWDT                           bv9
#define RCC_DEBUG_AWT                            bv6
#define RCC_DEBUG_BTIM123                        bv5
#define RCC_DEBUG_GTIM                           bv1
#define RCC_DEBUG_ATIM                           bv0
#define IS_RCC_DEBUG(PERIPH)                     (((PERIPH)==RCC_DEBUG_WWDT)||\
                                                 ((PERIPH) == RCC_DEBUG_IWDT) ||    \
                                                 ((PERIPH) == RCC_DEBUG_AWT) ||     \
                                                 ((PERIPH) == RCC_DEBUG_BTIM123) || \
                                                 ((PERIPH) == RCC_DEBUG_GTIM) ||    \
                                                 ((PERIPH) == RCC_DEBUG_ATIM))

/* SYSCTRL GTIMCAP --------------------------------------------------------*/
#define GTIM_CAP_GPIO                            (0x00UL)
#define GTIM_CAP_RXD1                            (0x01UL)
#define GTIM_CAP_RXD2                            (0x02UL)
#define GTIM_CAP_VCO1                            (0x04UL)
#define GTIM_CAP_VCO2                            (0x05UL)
#define GTIM_CAP_LVDO                            (0x06UL)
#define IS_GTIM_CAP_INPUT(IN)                    (((IN)==GTIM_CAP_GPIO)||\
                                                 ((IN) == GTIM_CAP_RXD1) ||\
                                                 ((IN) == GTIM_CAP_RXD2) ||\
                                                 ((IN) == GTIM_CAP_VCO1) ||\
                                                 ((IN) == GTIM_CAP_VCO2) ||\
                                                 ((IN) == GTIM_CAP_LVDO))

/* SYSCTRL ATIMETR --------------------------------------------------------*/
#define ATIM_ETR_GPIO                            (0x00UL)
#define ATIM_ETR_RXD1                            (0x01UL)
#define ATIM_ETR_RXD2                            (0x02UL)
#define ATIM_ETR_VCO1                            (0x04UL)
#define ATIM_ETR_VCO2                            (0x05UL)
#define ATIM_ETR_LVDO                            (0x06UL)
#define IS_ATIM_ETR_INPUT(IN)                    (((IN)==ATIM_ETR_GPIO)||\
                                                 ((IN) == ATIM_ETR_RXD1) || \
                                                 ((IN) == ATIM_ETR_RXD2) || \
                                                 ((IN) == ATIM_ETR_VCO1) || \
                                                 ((IN) == ATIM_ETR_VCO2) || \
                                                 ((IN) == ATIM_ETR_LVDO))

