21mw12/CW32_Voltammeter/电压电流表资料/3 基础实验例程/实验五_ADC采样显示/Driver/cw32f003_rcc.h
/* SYSCTRL GTIMETR --------------------------------------------------------*/
#define GTIM_ETR_GPIO                            (0x00UL)
#define GTIM_ETR_RXD1                            (0x01UL)
#define GTIM_ETR_RXD2                            (0x02UL)
#define GTIM_ETR_VCO1                            (0x04UL)
#define GTIM_ETR_VCO2                            (0x05UL)
#define GTIM_ETR_LVDO                            (0x06UL)
#define IS_GTIM_ETR_INPUT(IN)                    (((IN)==GTIM_ETR_GPIO)||\
                                                 ((IN) == GTIM_ETR_RXD1) || \
                                                 ((IN) == GTIM_ETR_RXD2) || \
                                                 ((IN) == GTIM_ETR_VCO1) || \
                                                 ((IN) == GTIM_ETR_VCO2) || \
                                                 ((IN) == GTIM_ETR_LVDO))

/* SYSCTRL TIMITR --------------------------------------------------------*/
#define RCC_TIMITR_BTIM1                         (0UL)
#define RCC_TIMITR_BTIM2                         (1UL)
#define RCC_TIMITR_BTIM3                         (2UL)
#define RCC_TIMITR_GTIM                          (3UL)
#define RCC_TIMITR_ATIM                          (7UL)
#define IS_RCC_TIMITR_SOURCE(SRC)                ((SRC)<4||(SRC)==RCC_TIMITR_ATIM)

/* SYSCTRL MCO --------------------------------------------------------*/
#define RCC_MCO_DIV1                             (0x00U)
#define RCC_MCO_DIV2                             ((uint8_t)(0x01U<<SYSCTRL_MCO_DIV_Pos))
#define RCC_MCO_DIV8                             ((uint8_t)(0x02U<<SYSCTRL_MCO_DIV_Pos))
#define RCC_MCO_DIV64                            ((uint8_t)(0x03U<<SYSCTRL_MCO_DIV_Pos))
#define RCC_MCO_DIV128                           ((uint8_t)(0x04U<<SYSCTRL_MCO_DIV_Pos))
#define RCC_MCO_DIV256                           ((uint8_t)(0x05U<<SYSCTRL_MCO_DIV_Pos))
#define RCC_MCO_DIV512                           ((uint8_t)(0x06U<<SYSCTRL_MCO_DIV_Pos))
#define RCC_MCO_DIV1024                          ((uint8_t)(0x07U<<SYSCTRL_MCO_DIV_Pos))

#define IS_RCC_MCO_DIV(INSTANCE)                 (((INSTANCE)==RCC_MCO_DIV1)||\
                                                 ((INSTANCE) == RCC_MCO_DIV2)          ||\
                                                 ((INSTANCE) == RCC_MCO_DIV8)          ||\
                                                 ((INSTANCE) == RCC_MCO_DIV64)         ||\
                                                 ((INSTANCE) == RCC_MCO_DIV128)        ||\
                                                 ((INSTANCE) == RCC_MCO_DIV256)        ||\
                                                 ((INSTANCE) == RCC_MCO_DIV512)        ||\
                                                 ((INSTANCE) == RCC_MCO_DIV1024)) 

#define RCC_MCO_SRC_NONE                         (0x00U)
#define RCC_MCO_SRC_HCLK                         (0x01U)
#define RCC_MCO_SRC_PCLK                         (0x02U)
#define RCC_MCO_SRC_HSI                          (0x03U)
#define RCC_MCO_SRC_LSI                          (0x04U)
#define RCC_MCO_SRC_HEX                          (0x05U)
#define RCC_MCO_SRC_RC150K                       (0x08U)
#define RCC_MCO_SRC_RC10K                        (0x09U)

#define IS_RCC_MCO_SRC(INSTANCE)                 (((INSTANCE)==RCC_MCO_SRC_NONE)||\
                                                 ((INSTANCE) == RCC_MCO_SRC_HCLK)       || \
                                                 ((INSTANCE) == RCC_MCO_SRC_PCLK)       || \
                                                 ((INSTANCE) == RCC_MCO_SRC_HSI)        || \
                                                 ((INSTANCE) == RCC_MCO_SRC_LSI)        || \
                                                 ((INSTANCE) == RCC_MCO_SRC_HEX)        || \
                                                 ((INSTANCE) == RCC_MCO_SRC_RC150K)     || \
                                                 ((INSTANCE) == RCC_MCO_SRC_RC10K))



//==================================================================================
extern void RCC_HCLKPRS_Config(uint32_t HCLKPRS);
extern void RCC_PCLKPRS_Config(uint32_t PCLKPRS);
extern void RCC_SYSCLKSRC_Config(uint32_t SYSCLKSRC);
extern void RCC_LSI_Enable(void);
extern void RCC_LSI_Disable(void);
extern void RCC_HEX_Enable(uint32_t PINMUX);
extern void RCC_HEX_Disable(void);
extern void RCC_HSI_Enable(uint32_t HSIDiv);
extern void RCC_HSI_Disable(void);
extern void RCC_WAKEUPCLK_Config(uint32_t WAKEUPCLK);
extern void RCC_LOCKUP_Config(uint32_t LOCKUP);
extern void RCC_SWDIO_Config(uint32_t SWDIO);
extern void RCC_RSTIO_Config(uint32_t RSTIO);
extern void RCC_DeInit(void);
extern void RCC_SystemCoreClockUpdate(uint32_t NewFreq);
extern uint8_t RCC_SysClk_Switch(uint32_t NewClk);
extern void RCC_ITConfig(uint32_t RCC_IT, FunctionalState NewState);
extern ITStatus RCC_GetITStatus(uint32_t RCC_IT);
extern void RCC_ClearITPendingBit(uint32_t RCC_IT);
extern FlagStatus RCC_GetStableFlag(uint32_t RCC_STABLEFLAG);
extern uint32_t RCC_GetAllStableFlag( void );
extern void RCC_AHBPeriphClk_Enable(uint32_t Periph,FunctionalState NewState);
extern void RCC_APBPeriphClk_Enable1(uint32_t Periph,FunctionalState NewState);
extern void RCC_APBPeriphClk_Enable2(uint32_t Periph,FunctionalState NewState);
extern void RCC_AHBPeriphReset(uint32_t Periph,FunctionalState NewState);
extern void RCC_APBPeriphReset1(uint32_t Periph,FunctionalState NewState);
extern void RCC_APBPeriphReset2(uint32_t Periph,FunctionalState NewState);
extern FlagStatus RCC_GetRstFlag(uint32_t RCC_RSTFLAG);
extern uint32_t RCC_GetAllRstFlag( void );
extern void RCC_ClearRstFlag(uint32_t RCC_RSTFLAG);
extern void RCC_HCLK_OUT(void);
extern void RCC_PCLK_OUT(void);
extern void RCC_MCO_OUT(uint8_t Source, uint8_t Div);
extern void RCC_DEBUG_Config(uint32_t Periph, FunctionalState NewState);

extern uint32_t RCC_Sysctrl_GetHClkFreq(void);
extern uint32_t RCC_Sysctrl_GetPClkFreq(void);

void RCC_BTIM3ITRSelect(uint32_t Source);
void RCC_BTIM2ITRSelect(uint32_t Source);
void RCC_BTIM1ITRSelect(uint32_t Source);
void RCC_GTIMITRSelect(uint32_t Source);
void RCC_ATIMITRSelect(uint32_t Source);

#ifdef __cplusplus
}
#endif

#endif /* __CW32F003_RCC_H */
